In [5]:
import pandas as pd

In [6]:
dt1 = pd.read_csv("C:/Users/test4/Desktop/대학 강의/2-2/데이터처리프로그래밍/dataset/2014.csv",encoding='euc-kr')
dt2 = pd.read_csv("C:/Users/test4/Desktop/대학 강의/2-2/데이터처리프로그래밍/dataset/2015.csv",encoding='euc-kr')
dt3 = pd.read_csv("C:/Users/test4/Desktop/대학 강의/2-2/데이터처리프로그래밍/dataset/2016.csv",encoding='euc-kr')

In [8]:
dt = pd.concat([dt1, dt2, dt3])

In [9]:
dt.head()

        구분  사고(건)  사망(명)  부상(명)
0  2014년1월    169      7    347
1  2014년2월    145      3    268
2  2014년3월    206     12    358
3  2014년4월    182      4    360
4  2014년5월    218     17    474

In [11]:
sorted_dt = dt.sort_values(by='사망(명)', ascending=False)

사망자가 가장 많은 월:
구분       2015년8월
사고(건)        268
사망(명)         19
부상(명)        534
Name: 7, dtype: object

In [13]:
sorted_dt.head(10)

          구분  사고(건)  사망(명)  부상(명)
7    2015년8월    268     19    534
4    2014년5월    218     17    474
8    2014년9월    225     15    430
9   2015년10월    214     14    475
9   2014년10월    210     14    392
6    2014년7월    229     14    431
8    2016년9월    187     13    347
4    2016년5월    239     13    522
5    2014년6월    233     13    457
11  2014년12월    178     12    329

In [18]:
dt[dt['사망(명)']==dt['사망(명)'].max()]

        구분  사고(건)  사망(명)  부상(명)
7  2015년8월    268     19    534

In [20]:
dt[dt['사고(건)']==dt['사고(건)'].max()]

        구분  사고(건)  사망(명)  부상(명)
6  2015년7월    273      7    556

In [21]:
dt[dt['부상(명)']==dt['부상(명)'].max()]

        구분  사고(건)  사망(명)  부상(명)
6  2015년7월    273      7    556